<template>
    <div class="content">
        <div class="content__word">
            <p>当前我国关于安宁疗护服务建设的关注度在不断提升，</p>
            <p>但在实际运行与推广过程中，</p>
            <p>其发展还面临着诸多痛点与难点。</p>

            <p>【入不敷出】</p>
            <p>据医学界报道，2021年11月30日，开设了1391天后，某中部省会城市的第一家安宁疗护中心悄然谢幕，</p>
            <p>一同“歇业”的，还有J主任和他的10名医护团队。</p>
            <p>10月初，几经内部协商，医院最终把关停安宁疗护中心的消息告知了J主任。</p>
            <p>对此，他表示理解，认为“关停也是无奈之举”。</p>
            <p>在发展安宁疗护政策已经陆续出台情况下，J主任却没能获得“安宁”。</p>
            <p>“我们之前做过一些转型尝试，比如提出了‘整合安宁疗护模式’，</p>
            <p>将养老服务和安宁疗护、缓和医疗和普通医疗、医疗服务和殡葬服务相结合，</p>
            <p>通过对患者和家属的整体照顾，来践行安宁疗护的理念，让这一行业能够可持续性发展，也基本达到了收支平衡，</p>
            <p>但现实情况是，医院不可能不考虑经济效益等现实问题。”</p>
            
            <p>现今，各大安宁疗护相关试点城市虽已制定了安宁疗护费用结算办法，</p>
            <p>部分城市也将安宁疗护纳入医保范畴。</p>
            <p>但各地标准并不统一，呈现碎片化发展，部分运营的医疗机构也依旧处于艰难发展状态。</p>
        
            <p>具体而言，首先是临床日常的大量工作尚无收费标准。</p>
            <p>与常规安宁疗护项目相比，患者及其家属对心理关怀、哀伤辅导等精神照护服务项目同样有较大需求，</p>
            <p>但因为我国现行医疗机构主要通过具体的治疗措施和用药设置收费标准，上述人工成本很难通过收费得到弥补。</p>
            <p> 其次，医保报销核定标准不足。</p>
            <p>即使部分试点城市已率先将安宁疗护纳入医保支付范围内，</p>
            <p>但医保结算安宁疗护费用往往采用医院预付，再由医保统筹基金拨付的结算方式。</p>
            <p>因此，医院服务主体开展相关服务的运营成本仍然较大，难以调动更多的医疗机构提供安宁疗护服务。</p>
        
            <p>【安宁难觅】</p>
            <p>11月30日上午约九点半，该医院安宁疗护中心迎来今日第一位接“病人转院”的家属，</p>
            <p>这是位重度脑中风患者，衣食起居无法自理，在中心住了近3年。</p>
            <p>老人用模糊的声音传递着这一消息，“我不去，我不去。”</p>
            <p>家属说：“我们收到转院的消息后心里很不是滋味，</p>
            <p>老人在这里住了这么长时间，工作人员就像对自己家亲人一样照顾他，后面只能转去养老院，</p>
            <p>但那里没有专业的医疗人员，只能在生活上管一下他，医疗方面还得再想办法。”</p>

            <p>据计算，截至2021年底，</p>
            <p>我国每10万人口拥有的安宁疗护床位为19.96张；</p>
            <p> 每1万常住人口拥有的安宁执业医师仅0.18人，安宁护士仅0.17人，</p>
            <p>对比世界卫生组织（WHO）标准还有倍数级的差距。</p>
            <p>并且，中国大部分安宁疗护从业人员未曾接受过专业培训。</p>
            <p>在兼职人文关怀服务时，其缺乏必备的伦理、心理、社会等方面专业知识，导致服务开展困难。</p>
            <p>对于有安宁疗护需求的病人来说，各地对患者收治的标准不同也极大阻碍了安宁疗护的开展。</p>
            <p>如安徽省蚌埠市根据 《蚌埠市安宁疗护病人病情(生存期)评估单》及 《Karnofsky功能状态评分标准》对患者进行评估，</p>
            <p>上海市采用卡氏功能评分量表(KPS)和姑息功能量表 (PPs)对患者进行评估。</p>
            <p>同样条件的患者，在一些城市可进入安宁疗护服务，在另外一些城市却因收治标准不一，</p>
            <p>无法接受服务，造成了收治差异化。</p>

            <p>【无奈与坚持】</p>
            <p>需要交代的不仅是患者及其家属，还有10名医护人员，也包括J主任自己。</p>
            <p>除了转运走的患者，他最放不下的就是团队内的护士和护工们。</p>
            <p>“医护团队3年里很少发生人员变动，没想到这一次就全部要分开了，</p>
            <p>我今年61岁了，但他们大部分都是80、90后，还需要生活，我觉得自己非常对不起他们。”</p>
            <p>复旦大学附属肿瘤医院综合治疗科主任成文武主任，是国内从事安宁疗护的先行者之一。</p>
            <p>他对此无奈地说：“收入少、压力大、技术要求高、归感低是这一行的通病，</p>
            <p>但我还在坚持，直到退休。”</p>

            <p>由于安宁疗护的收入低，工作不被人们所理解，</p>
            <p>加上在很多地方还不是一个临床专业，医护人员的专业建设和晋升都受到了制约。</p>
            <p> 因此，若医护人员的心理状况不能得到积极的调节，无疑会对安宁疗护的工作造成影响。</p>
            <p>在《贵州省临终关怀现状调查与研究》中，孟玲等人发现，</p>
            <p>在1306名医护人员中，78.3%的人认为临终关怀不仅会使他们身心俱疲，</p>
            <p>还会产生强烈的失落感和焦虑感，从而不愿参与临终关怀。</p>
        </div>
    </div>
</template>

<script>
export default {
    name: "MainPage",
}
</script>

<style lang="scss" scoped>
.content{
    background-repeat: no-repeat !important;
	background-size: cover !important;
    height: 600vh;
    background-color: rgb(220, 220, 220);
    position: relative;
    &__word{
        position: absolute;
        width:100%;
        height: 100%;
        left:50%;
        margin-left: -50%;
        p{
            height:.4rem;
            line-height: .4rem;
            text-align: center;
            font-size: .15rem;
        }
        p:nth-child(3),p:nth-child(13),p:nth-child(16),p:nth-child(23),
        p:nth-child(30),p:nth-child(41),p:nth-child(49),p:nth-child(55){
            margin-bottom: .3rem;
        }
        p:nth-child(1)::first-letter{
            font-size: .5rem;
            font-family: Cambria, Cochin, Georgia, Times, 'Times New Roman', serif;
            font-style: italic;
        }
    }
}
.chartBoxs{
    width: 100%;
    height: 4em;
    position: relative;
}
.chartBox{
    width: 100%;
    height: 4rem;
    position: absolute;
    // left:50%;
    // margin-left: -2.5rem !important;
    margin: 0 auto;
    &__chart{
        height: 9rem;
        position: absolute;
        left: 1.5rem;
    }
}
</style>